nxp-mcuxpresso/mcux-soc-svd/MCXA146/MCXA146.xml
        <register>
          <name>SWCOUT</name>
          <description>Software Controlled Output Register</description>
          <addressOffset>0x184</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SM0OUT45</name>
              <description>Submodule 0 Software Controlled Output 45</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGIC_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 0 instead of PWM45.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGIC_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 0 instead of PWM45.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM0OUT23</name>
              <description>Submodule 0 Software Controlled Output 23</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGIC_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 0 instead of PWM23.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGIC_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 0 instead of PWM23.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM1OUT45</name>
              <description>Submodule 1 Software Controlled Output 45</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGIC_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 1 instead of PWM45.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGIC_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 1 instead of PWM45.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM1OUT23</name>
              <description>Submodule 1 Software Controlled Output 23</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGIC_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 1 instead of PWM23.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGIC_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 1 instead of PWM23.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM2OUT45</name>
              <description>Submodule 2 Software Controlled Output 45</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGIC_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 2 instead of PWM45.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGIC_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 2 instead of PWM45.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM2OUT23</name>
              <description>Submodule 2 Software Controlled Output 23</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGIC_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 2 instead of PWM23.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGIC_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 2 instead of PWM23.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DTSRCSEL</name>
          <description>PWM Source Select Register</description>
          <addressOffset>0x186</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SM0SEL45</name>
              <description>Submodule 0 PWM45 Control Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM0PWM45</name>
                  <description>Generated SM0PWM45 signal used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED_SM0PWM45</name>
                  <description>Inverted generated SM0PWM45 signal used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM0OUT45</name>
                  <description>SWCOUT[SM0OUT45] used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM0SEL23</name>
              <description>Submodule 0 PWM23 Control Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM0PWM23</name>
                  <description>Generated SM0PWM23 signal used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED_SM0PWM23</name>
                  <description>Inverted generated SM0PWM23 signal used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM0OUT23</name>
                  <description>SWCOUT[SM0OUT23] used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM0_EXTA</name>
                  <description>PWM0_EXTA signal used by the deadtime logic.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM1SEL45</name>
              <description>Submodule 1 PWM45 Control Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM1PWM45</name>
                  <description>Generated SM1PWM45 signal used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED_SM1PWM45</name>
                  <description>Inverted generated SM1PWM45 signal used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM1OUT45</name>
                  <description>SWCOUT[SM1OUT45] used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM1SEL23</name>
              <description>Submodule 1 PWM23 Control Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM1PWM23</name>
                  <description>Generated SM1PWM23 signal used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED_SM1PWM23</name>
                  <description>Inverted generated SM1PWM23 signal used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM1OUT23</name>
                  <description>SWCOUT[SM1OUT23] used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM1_EXTA</name>
                  <description>PWM1_EXTA signal used by the deadtime logic.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM2SEL45</name>
              <description>Submodule 2 PWM45 Control Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM2PWM45</name>
                  <description>Generated SM2PWM45 signal used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED_SM2PWM45</name>
                  <description>Inverted generated SM2PWM45 signal used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM2OUT45</name>
                  <description>SWCOUT[SM2OUT45] used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM2SEL23</name>
              <description>Submodule 2 PWM23 Control Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM2PWM23</name>
                  <description>Generated SM2PWM23 signal used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED_SM2PWM23</name>
                  <description>Inverted generated SM2PWM23 signal used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM2OUT23</name>
                  <description>SWCOUT[SM2OUT23] used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM2_EXTA</name>
                  <description>PWM2_EXTA signal used by the deadtime logic.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCTRL</name>
          <description>Master Control Register</description>
          <addressOffset>0x188</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>LDOK</name>
              <description>Load Okay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Do not load new values.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Load prescaler, modulus, and PWM values of the corresponding submodule.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLDOK</name>
              <description>Clear Load Okay</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RUN</name>
              <description>Run</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>PWM counter is stopped, but PWM outputs hold the current state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>PWM counter is started in the corresponding submodule.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPOL</name>
              <description>Current Polarity</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM23</name>
                  <description>PWM23 is used to generate complementary PWM pair in the corresponding submodule.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM45</name>
                  <description>PWM45 is used to generate complementary PWM pair in the corresponding submodule.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCTRL2</name>
          <description>Master Control 2 Register</description>
          <addressOffset>0x18A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>WRPROT</name>
              <description>Write protect</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write protection off (default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write protection on.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED_LOCKED</name>
                  <description>Write protection off and locked until chip reset.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_LOCKED</name>
                  <description>Write protection on and locked until chip reset.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STRETCH_CNT_PRSC</name>
              <description>Stretch IPBus clock count prescaler for mux0_trig/mux1_trig/out0_trig/out1_trig/pwma_trig/pwmb_trig</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Stretch count is zero, no stretch.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Stretch mux0_trig/mux1_trig/out0_trig/out1_trig/pwma_trig/pwmb_trig for 2 IPBus clock period.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED_LOCKED</name>
                  <description>Stretch mux0_trig/mux1_trig/out0_trig/out1_trig/pwma_trig/pwmb_trig for 4 IPBus clock period.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_LOCKED</name>
                  <description>Stretch mux0_trig/mux1_trig/out0_trig/out1_trig/pwma_trig/pwmb_trig for 8 IPBus clock period.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
